#+TITLE: SICP Exercise Solutions for Section 2.2.3 and 2.2.4
#+AUTHOR: Paul L. Snyder
#+EMAIL: paul@pataprogramming.com
#+TODO: TODO(t) WRITEUP(w) || (d)

#+OPTIONS: num:0

#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usepackage{color}
#+LaTeX_HEADER: \usepackage{xcolor}
#+LateX_HEADER: \usemintedstyle{friendly}
#+LaTeX_HEADER: \newminted{clojure}{fontsize=\large}
#+LaTeX_HEADER: \newminted{java}{fontsize=\large}
#+LaTeX_HEADER: \newminted{common-lisp}{fontsize=\large}
#+LaTeX_HEADER: \newminted{scheme}{fontsize=\large}

#+name: setup-minted
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'minted)
  (add-to-list 'org-latex-packages-alist '("" "minted"))
  (setq org-latex-custom-lang-environments
        '(
         (emacs-lisp "common-lispcode")
         (scheme "schemecode")
         (lisp "common-lispcode")
         (java "javacode")
         (clojure "clojurecode")
          ))
  (setq org-latex-minted-options
        '(("frame" "lines")
          ("fontsize" "\\normalsize")
          ("linenos" "")))
  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

#+BEGIN_LaTeX
\newcommand{\red}[1]{{\color{red}#1}}
\newcommand{\orange}[1]{{\color{orange}#1}}
\newcommand{\purple}[1]{{\color{purple}#1}}
\definecolor{darkgreen}{HTML}{006B3C}
\newcommand{\green}[1]{{\color{darkgreen}#1}}
\newcommand{\blue}[1]{{\color{blue}#1}}
\definecolor{indigo}{HTML}{4B0082}
\newcommand{\indigo}[1]{{\color{indigo}#1}}
\newcommand{\java}{\red{Java}}
\newcommand{\lisp}{\red{Lisp}}
\newcommand{\clojure}{\blue{Clojure}}
#+END_LaTeX

#+BEGIN_SRC scheme :session 2-2b :results silent
  (require (planet neil/sicp:1:17))
#+END_SRC

#+BEGIN_SRC scheme :eval never :tangle 2-2b.rkt
  #lang planet neil/sicp
#+END_SRC

*** Solution

It seems odd that the coefficient sequence is ordered in an order that
is reversed from what one might expect.  But, as can be seen from a
close examination, =accumulate= builds up its results recursively.

First, we'll calculate the long way, to make sure the procedure we
write produces the right result.

$$1 + 3\cdot2 + 5\cdot2^3 + 2^5 = 1 + 6 + 5\times8 + 32 = 79$$

#+BEGIN_SRC scheme :session 2-2b :results none
  (define (horner-eval x coefficient-sequence)
    (accumulate (lambda (this-coeff higher-terms)
                  (+ this-coeff (* x higher-terms)))
                0
                coefficient-sequence))
#+END_SRC

This problem almost helps you too far along the path. It's quite clear
how the arguments to the lambda should be manipulated in the body,
given its naming. The reversal remains profoundly counter-intuitive,
though (at least to me).

We can easily verify that this procedure produces the correct result:

#+BEGIN_SRC scheme :session 2-2b
  (horner-eval 2 (list 1 3 0 5 0 1))
#+END_SRC

#+RESULTS:
: 79

*** Solution

We begin by recalling the definition of =count-leaves= from the text:

#+BEGIN_SRC scheme :session 2-2b :results none
  (define (count-leaves x)
    (cond ((null? x) 0)
          ((not (pair? x)) 1)
          (else (+ (count-leaves (car x))
                   (count-leaves (cdr x))))))
#+END_SRC

We can see that the exercises are beginning to give us less help...but
there's still an important piece of information: the sequence is
processed using =map= before the =accumulate= call is processed. The
formulation of the original =count-leaves= further lets us that that,
almost certain, recursion will be required to solve this problem.

The first thing we realize is that the initial value should be 0,
since we're counting things:

#+BEGIN_SRC scheme :eval never
  (define (count-leaves t)
    (accumulate <??> 0 (map <??> <??>)))
#+END_SRC

We also know that the first argument is going to be a procedure, so we
can plug in a lambda as a placeholder.

#+BEGIN_SRC scheme :eval never
  (define (count-leaves t)
    (accumulate (lambda (subtotal running-total) <??>) 0 (map <??> <??>)))
#+END_SRC

We can also begin to fill in the =map='s arguments, since the first
also has to be a lambda, while the second one is a list: and since the
overall tree =t= has to be supplied at some point, the second position
is the most sensible location

#+BEGIN_SRC scheme :eval never
  (define (count-leaves t)
    (accumulate (lambda (subtotal running-total) <??>)
                0
                (map (lambda (x) <??>) t)))
#+END_SRC

What could that second lambda be? Well, what we /wish/ we could supply
to the accumulate is a list with subtotal of the leaves in that
particular branch of the tree.  And, in fact, we have a procedure that
can do that for us: =count-leaves= itself! Here's the recursive call.

#+BEGIN_SRC scheme :eval never
  (define (count-leaves t)
    (accumulate (lambda (subtotal running-total) <??>)
                0
                (map count-leaves t)))
#+END_SRC

This lets us realize what the first procedure should be as well:
addition! All we need to do is sum the list of subtotals.

#+BEGIN_SRC scheme :eval never
  (define (count-leaves t)
    (accumulate + 0 (map count-leaves t)))
#+END_SRC

Sadly, our wishful thinking has taken us a bit too far: the =map= will
fail if supplied a second argument that is not a list. So, we have to
go back to a lambda, to wrap the call to =count-leaves= to handle the
termination cases.

#+BEGIN_SRC scheme :session 2-2b :results none
  (define (count-leaves t)
    (accumulate + 0 (map
                     (lambda (x)
                       (cond ((null? x)       0)
                             ((not (pair? x)) 1)
                             (true            (count-leaves x))))
                     t)))
#+END_SRC


And, this does indeed work the way that we would hope and expect:

#+BEGIN_SRC scheme :session 2-2b :output value
(count-leaves (list (list 1 2) 3 4))
#+END_SRC

#+RESULTS:
: 4

Whether this formulation is an actual improvement is left as an
exercise for the reader.

*** Solution

The approach to this problem builds quite naturally on everything that
comes before, and a bit of thought should reveal that you can make a
sequence of the first elements of each list by simple =map=ping over
the =car=s. Similarly, =map=ping over the =cdr=s results will strip
off the already-processed first elements.

#+BEGIN_SRC scheme :session 2-2b :results none
  (define (accumulate-n op init seqs)
    (if (null? (car seqs))
        nil
        (cons (accumulate op init (map car seqs))
              (accumulate-n op init (map cdr seqs)))))
#+END_SRC

#+BEGIN_SRC scheme :session 2-2b :results output
  (define s (list (list 1 2 3) (list 4 5 6) (list 7 8 9) (list 10 11 12)))

  (display (accumulate-n + 0 s))
#+END_SRC

#+RESULTS:
: (22 26 30)

*** Solution

The first definition, the matrix-vector product is fairly easy: from
the definition in the table, we can see that the form of the operation
is quite similar to dot product. In fact, the $i$th element of the
resulting vector will be the dot production of the $i$th row of the
matrix with the vector $\mathbf{v}$.

#+BEGIN_SRC scheme :session 2-2b :results none
  (define (matrix-*-vector m v)
    (map (lambda (m_i) (dot-product m_i v)) m))
#+END_SRC

For a ready-figured example,
http://mathinsight.org/matrix_vector_multiplication

#+BEGIN_SRC scheme :session 2-2b :results output
(display (matrix-*-vector (list (list 1 -1 2) (list 0 -3 1)) (list 2 1 0)))
#+END_SRC

#+RESULTS:
: (1 -3)

The definition of =transpose= is brilliantly simple. From our
construction of =accumulate-n=, we saw how easy it was to
slice-and-dice the initial elements of multiple lists; we can use this
exact same procedure to build a new list of each using =cons=.

#+BEGIN_SRC scheme :session 2-2b :results output
  (define (transpose mat)
    (accumulate-n cons nil mat))

  (define m (list (list 1 -1 2) (list 0 -3 1)))

  (display (transpose m))
#+END_SRC

#+RESULTS:
: ((1 0) (-1 -3) (2 1))

The definition of matrix-matrix product in the text is a bit unhelpful in the context of this
exercise, though it is exactly the procedure you would perform to
calculate each resulting cell. It's easier to describe
the matrix-matrix product in terms of other operations: each column of
the resulting product matrix $\mathbf{P}$ is the matrix-vector product
of $\mathbf{A}$ with the corresponding column of $\mathbf{B}$.

The authors kindly transpose $\mathbf{N}$ for us in the provided
template, as by turning columns into rows we can easily map over them.

This looks like a good candidate for =accumulate-n=, at first...but
the entirety of $\mathbf{M}$ has to be used for every row of $\mathbf{N}$.

#+BEGIN_SRC scheme :session 2-2b :results output

  (define A (list (list 0 4 -2) (list -4 -3 0)))
  (define B (list (list 0 1) (list 1 -1) (list 2 3)))
  ;; AB = ((0 -10) (-3 -1))

  (define (matrix-*-matrix m n)
    (let ((cols (transpose n)))
      (transpose
       (map (lambda (p) (matrix-*-vector m p)) cols))))

  (display
   (matrix-*-matrix A B))
#+END_SRC

#+RESULTS:
: ((0 -10) (-3 -1))

Figure out a way around the extra transpose!

*** Solution

First, an alias for fold-right,

#+BEGIN_SRC scheme :session 2-2b :results none
  (define fold-right accumulate)
#+END_SRC

#+BEGIN_SRC scheme :session 2-2b :results value
  (fold-right / 1 (list 1 2 3))
#+END_SRC

#+RESULTS:
: 3/2

#+BEGIN_SRC scheme :session 2-2b :results value
  (fold-left / 1 (list 1 2 3))
#+END_SRC

#+RESULTS:
: 1/6

#+BEGIN_SRC scheme :session 2-2b :results output
  (display (fold-right list nil (list 1 2 3)))
#+END_SRC

#+RESULTS:
: (1 (2 (3 ())))

#+BEGIN_SRC scheme :session 2-2b :results output
  (display (fold-left list nil (list 1 2 3)))
#+END_SRC

#+RESULTS:
: (((() 1) 2) 3)

=op= should satisfy the property of /commutativity/ in order to have
the same result

